src/cf/Documents/уатДиспозицияТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатДиспозицияТС</Name>
			<BasedOn>
				<xr:Item>Document.уатДислокацияВагонов</xr:Item>
				<xr:Item>Document.уатНатурныйЛист</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.уатСостояниеТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Comment>Заказ</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСостояниеТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатДислокацияВагонов</v8:Type>
						<v8:Type>cfg:DocumentRef.уатНатурныйЛист</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокТССтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСостояниеТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Comment>Дата начала</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>Дата окончания</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/уатДиспозицияТС/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Объект.ДатаНачала = '00010101' Тогда
			Объект.ДатаНачала = ТекущаяДата();
		КонецЕсли;
		Если Объект.ДатаОкончания = '00010101' Тогда
			Объект.ДатаОкончания = КонецДня(ТекущаяДата());
		КонецЕсли;
	КонецЕсли;
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
		И Константы["такИспользоватьЗаказыТакси"].Получить() = Ложь
		И Константы["такИспользоватьАрендуТС"].Получить() = Ложь Тогда
		Элементы.Заказ.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уатЗаказГрузоотправителя");
	ИначеЕсли НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()	Тогда  
		Элементы.Заказ.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.уатЗаказГрузоотправителя");
	КонецЕсли;
	
	Если Объект.СписокТС.Количество() = 0 Тогда
		НоваяСтрока = Объект.СписокТС.Добавить();
		Если ЗначениеЗаполнено(Объект.ТС) Тогда
			НоваяСтрока.ТС = Объект.ТС;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.СписокТС.ТекущаяСтрока = Объект.СписокТС[0].ПолучитьИдентификатор();
	
	Если Объект.СписокТС.Количество() = 1 И Не ЗначениеЗаполнено(Объект.Состояние) Тогда
		Объект.Состояние = Объект.СписокТС[0].Состояние;
	ИначеЕсли Объект.СписокТС.Количество() > 1 Тогда
		СпособРедактирования = 1;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатДокументФормаЭлементаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Изменена диспозиция ТС", Объект.Ссылка, ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если СпособРедактирования = 0 И Не ЗначениеЗаполнено(Объект.СписокТС[0].ДатаНачала) Тогда
		Объект.СписокТС[0].ДатаНачала = Объект.Дата;
	КонецЕсли;
	
	Если Объект.СписокТС.Количество() = 1 И СпособРедактирования = 1 Тогда
		Объект.Состояние = Объект.СписокТС[0].Состояние;
	ИначеЕсли Объект.СписокТС.Количество() > 1 Тогда
		СпособРедактирования = 1;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("Организация", Объект.Организация);
	ТекущиеДанные = Элементы.СписокТС.ТекущиеДанные;
	уатИнтерфейсВводаТС.РеквизитТСНачалоВыбора(Элемент, ТекущиеДанные.ТС, ДанныеВыбора, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("Организация", Объект.Организация);
	уатИнтерфейсВводаТС.РеквизитТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ТСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("Организация", Объект.Организация);
	уатИнтерфейсВводаТС.РеквизитТСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокТСПоДокументу(Документ, ДопПараметры)
	Если ДопПараметры.Очистить Тогда
		Объект.СписокТС.Очистить();
	КонецЕсли;
	Модифицрованность = Истина;
	Для каждого ТекВагон Из Документ.Вагоны Цикл
		НоваяСтрока = Объект.СписокТС.Добавить();
		ТипНатурныйЛист      = "ДокументСсылка.уатНатурныйЛист";
		ТипДислокацияВагонов = "ДокументСсылка.уатДислокацияВагонов";
		Если ТипЗнч(Документ) = Тип(ТипНатурныйЛист) Тогда
			НоваяСтрока.ТС = ТекВагон.НомерВагона;
		ИначеЕсли ТипЗнч(Документ) = Тип(ТипДислокацияВагонов) Тогда
			НоваяСтрока.ТС = ТекВагон.Вагон;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораДокументаДляЗаполнения(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьСписокТСПоДокументу(Результат, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВагоныПоДокументу(Результат, ДопПараметры) Экспорт
	ДополнительныеПараметры = Новый Структура();
	Очистить = ?(Результат = КодВозвратаДиалога.Да, Истина, Ложь);
	ДополнительныеПараметры.Вставить("Очистить", Очистить);
	ОповещениеОВыборе = Новый ОписаниеОповещения("ЗавершениеВыбораДокументаДляЗаполнения", ЭтотОбъект, ДополнительныеПараметры);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗаполнитьПо", ДопПараметры);
	ФормаСпискаКритерийОтбора = "КритерийОтбора.уатВагоныВДиспозицииИНатурныхЛистах.ФормаСписка";
	ОткрытьФорму(ФормаСпискаКритерийОтбора,ПараметрыОткрытия,,,,,
	ОповещениеОВыборе,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДислокации(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьВагоныПоДокументу", ЭтотОбъект, "Дислокация");
	ТекстВопроса = НСтр("en='Clear the tabular section before filling?';ru='Очистить табличную часть при заполнении?'");
	ТекстЗаголовка = НСтр("en='Clear the table';ru='Очистка таблицы'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, ТекстЗаголовка);
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоНатурномуЛисту(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьВагоныПоДокументу", ЭтотОбъект, "НатурныйЛист");
	ТекстВопроса = НСтр("en='Clear the tabular section before filling?';ru='Очистить табличную часть при заполнении?'");
	ТекстЗаголовка = НСтр("en='Clear the table';ru='Очистка таблицы'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, ТекстЗаголовка);
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура СпособРедактрованияПриИзменении(Элемент)
	Если Не Булево(СпособРедактирования) И Объект.СписокТС.Количество() > 1 Тогда
		ТекстНСТР = НСтр("ru='Все строки ТС, кроме первой, будут удалены. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("СпособРедактрованияПриИзмененииЗавершение", ЭтотОбъект),
			ТекстНСТР, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
			
		Возврат;
	Иначе
		Если Объект.СписокТС.Количество()  = 0 Тогда
			НовоеТС = Объект.СписокТС.Добавить();
		КонецЕсли;
		
		Элементы.СписокТС.ТекущаяСтрока = Объект.СписокТС[0].ПолучитьИдентификатор();
		Если Булево(СпособРедактирования) Тогда
			Объект.СписокТС[0].Состояние = Объект.Состояние;
		Иначе
			Объект.Состояние = Объект.СписокТС[0].Состояние;
		КонецЕсли;
		СтрокаТС = Элементы.СписокТС.ТекущиеДанные;
	КонецЕсли;
	
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СпособРедактрованияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		СпособРедактирования = 1;
		Возврат;
	КонецЕсли;
	
	Пока Объект.СписокТС.Количество() > 1 Цикл
		СтрокаУдаления = Объект.СписокТС[1];
		Объект.СписокТС.Удалить(СтрокаУдаления);
	КонецЦикла;
	
	Элементы.СписокТС.ТекущаяСтрока = Объект.СписокТС[0].ПолучитьИдентификатор();
	Объект.Состояние = Объект.СписокТС[0].Состояние;
	
	УстановитьВидимость();
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьВидимость()
	Если СпособРедактирования = 0 Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ГруппаТС;
		Элементы.Состояние.Видимость = Истина;
		Элементы.ГруппаПериод.Видимость = Истина;
	Иначе
		Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ГруппаСписокТС;
		Элементы.Состояние.Видимость = Ложь;
		Элементы.ГруппаПериод.Видимость = Ложь;
	КонецЕсли;
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() Тогда
		Элементы.ГруппаКоманды.Видимость = ПолучитьФункциональнуюОпцию("уатИспользоватьЖДПеревозки");
	Иначе
		Элементы.ГруппаКоманды.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
